---
kind: property
id: P:Autodesk.Revit.DB.Structure.Rebar.ScheduleMark
zh: 钢筋、配筋
source: html/552fe461-637c-5f93-df6b-76c9c85d36be.htm
---
# Autodesk.Revit.DB.Structure.Rebar.ScheduleMark Property

**中文**: 钢筋、配筋

The Schedule Mark parameter. On creation, the Schedule Mark is set
 to a value that is unique to the host, but it can be set to
 any value.

## Syntax (C#)
```csharp
public string ScheduleMark { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null